ChartsOfCharacteristicTypes/гф_ГлобальныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<ChartOfCharacteristicTypes>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гф_ГлобальныеЗначения</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.гф_ГлобальныеЗначения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДанныеХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.гф_ГлобальныеЗначения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорыДляРоялти</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

CommonModules/_омОбщегоНазначения/Ext/Module.bsl
Функция ЕстьПолныеПрава() Экспорт
	Возврат РольДоступна("ПолныеПрава");
КонецФункции

Функция ЕстьПраваЭксперта() Экспорт
	//Возврат РольДоступна("_ЭкспертПоКонфигурации");
	Возврат ЕстьПолныеПрава();
КонецФункции

Функция ЕстьПравоДоступа(Право, ПолноеИмяМД) Экспорт
	Возврат ПравоДоступа(Право, Метаданные.НайтиПоПолномуИмени(ПолноеИмяМД));
КонецФункции

Функция ПроверитьНаличиеПравЭкспертаПоКонфигурации(Отказ) Экспорт
	Если не ЕстьПраваЭксперта() Тогда
		Возврат _омОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Нет прав на выполнение операции!", Отказ);
	КонецЕсли;
	
	Возврат истина;
КонецФункции



Функция ЗначениеРеквизитаОбъекта(Знач Ссылка, Знач ТаблицаОбъекта, Знач ИмяРеквизита, ЗначениеПоУмолчанию = Неопределено, ВыбратьРазрешенные = ложь) Экспорт
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ" + ?(ВыбратьРазрешенные, " РАЗРЕШЕННЫЕ", "") + " ПЕРВЫЕ 1
	|	т." + ИмяРеквизита + " КАК Значение
	|ИЗ
	|	" + ТаблицаОбъекта + " КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Значение, ЗначениеПоУмолчанию);
КонецФункции

Функция ЗначенияРеквизитовОбъекта(Знач Ссылка, Знач ТаблицаОбъекта, Знач ПереченьРеквизитов, ВыбратьРазрешенные = ложь) Экспорт
	Струк = новый Структура(ПереченьРеквизитов);
	
	ПоляЗапроса = "";
	Для каждого Элем из Струк Цикл
		ПоляЗапроса = ПоляЗапроса + ?(ПоляЗапроса = "", "", ",") + "
		|	т." + Элем.Ключ + " КАК " + Элем.Ключ;
	КонецЦикла;
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ" + ?(ВыбратьРазрешенные, " РАЗРЕШЕННЫЕ", "") + " ПЕРВЫЕ 1" + ПоляЗапроса + "
	|ИЗ
	|	" + ТаблицаОбъекта + " КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Струк, Выборка);
	КонецЕсли;
	
	Возврат Струк;
КонецФункции


Функция ПолучитьГлобальноеЗначение(Имя, ЗначениеПоУмолчанию = Неопределено, ЗаменитьНеопределеноНаЗначениеПоУмолчанию = ложь) Экспорт
	УстановитьПривилегированныйРежим(истина);
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Имя", Имя);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	тДанные.Значение
	|ИЗ
	|	ПланВидовХарактеристик.гф_ГлобальныеЗначения КАК тДанные
	|ГДЕ
	|	тДанные.Ключ = &Имя";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат ?(ЗаменитьНеопределеноНаЗначениеПоУмолчанию и Выборка.Значение = Неопределено, ЗначениеПоУмолчанию, Выборка.Значение);
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;
КонецФункции

Функция ПолучитьГлобальноеЗначениеМассив(Имя) Экспорт
	УстановитьПривилегированныйРежим(истина);
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Имя", Имя);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	тДанные.Значение КАК Значение
	|ИЗ
	|	ПланВидовХарактеристик.гф_ГлобальныеЗначения.Список КАК тДанные
	|ГДЕ
	|	тДанные.Ссылка.Ключ = &Имя";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Значение");
КонецФункции

Функция ПолучитьГлобальноеЗначениеСАвторизацией(Имя) Экспорт
	УстановитьПривилегированныйРежим(истина);
	
	Струк = новый Структура("ЕстьДанные, Значение, Логин, Пароль", ложь);
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Имя", Имя);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	тДанные.Значение КАК Значение,
	|	тДанные.ДанныеХЗ КАК ДанныеХЗ
	|ИЗ
	|	ПланВидовХарактеристик.гф_ГлобальныеЗначения КАК тДанные
	|ГДЕ
	|	тДанные.Ключ = &Имя";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДанныеХЗ = Выборка.ДанныеХЗ.Получить();
		Если ТипЗнч(ДанныеХЗ) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(Струк, ДанныеХЗ);
		КонецЕсли;
		
		Струк.ЕстьДанные = истина;
		Струк.Значение = Выборка.Значение;
	КонецЕсли;
	
	Возврат Струк;
КонецФункции


Функция ЗначениеВМассив(Значение) Экспорт
	Массив = новый Массив;
	Массив.Добавить(Значение);
	
	Возврат Массив;
КонецФункции

Функция ОписаниеТипаСуммаБУ() Экспорт
	Возврат новый ОписаниеТипов("Число", новый КвалификаторыЧисла(15,2));
КонецФункции

Функция ОписаниеТипаСуммаУХ() Экспорт
	Возврат новый ОписаниеТипов("Число", новый КвалификаторыЧисла(18,5));
КонецФункции



// -----------------------------------------------------------
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С УНИВЕРСАЛЬНЫМИ КОЛЛЕКЦИЯМИ
// -----------------------------------------------------------

Функция СкопироватьУниверсальнуюКоллекцию(Коллекция) Экспорт
	Если ТипЗнч(Коллекция) = Тип("Массив") Тогда
		Результат = новый Массив;
		Для каждого Элем из Коллекция Цикл
			Результат.Добавить(Элем);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Коллекция) = Тип("Соответствие") Тогда
		Результат = новый Соответствие;
		Для каждого Элем из Коллекция Цикл
			Результат.Вставить(Элем.Ключ, Элем.Значение);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Коллекция) = Тип("Структура") Тогда
		Результат = новый Структура;
		Для каждого Элем из Коллекция Цикл
			Результат.Вставить(Элем.Ключ, Элем.Значение);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Коллекция) = Тип("ТаблицаЗначений") Тогда
		Результат = Коллекция.Скопировать();
		
	ИначеЕсли ТипЗнч(Коллекция) = Тип("ДеревоЗначений") Тогда
		Результат = Коллекция.Скопировать();
		
	Иначе
		Результат = Коллекция;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция СкопироватьУниверсальнуюКоллекциюРекурсивно(Коллекция) Экспорт
	Если ТипЗнч(Коллекция) = Тип("Массив") Тогда
		Результат = новый Массив;
		Для каждого Элем из Коллекция Цикл
			Результат.Добавить(СкопироватьУниверсальнуюКоллекциюРекурсивно(Элем));
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Коллекция) = Тип("Соответствие") Тогда
		Результат = новый Соответствие;
		Для каждого Элем из Коллекция Цикл
			Результат.Вставить(Элем.Ключ, СкопироватьУниверсальнуюКоллекциюРекурсивно(Элем.Значение));
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Коллекция) = Тип("Структура") Тогда
		Результат = новый Структура;
		Для каждого Элем из Коллекция Цикл
			Результат.Вставить(Элем.Ключ, СкопироватьУниверсальнуюКоллекциюРекурсивно(Элем.Значение));
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Коллекция) = Тип("ТаблицаЗначений") Тогда
		Результат = Коллекция.Скопировать();
		
	ИначеЕсли ТипЗнч(Коллекция) = Тип("ДеревоЗначений") Тогда
		Результат = Коллекция.Скопировать();
		
	Иначе
		Результат = Коллекция;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции


// ---------------------------------------------------
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТАБЛИЦАМИ ЗНАЧЕНИЙ
// ---------------------------------------------------

Функция ИменаЧисловыхКолонокТаблицы(Таблица) Экспорт
	типЧисло = Тип("Число");
	списокПолей = "";
	Для каждого Элем из Таблица.Колонки Цикл
		Если Элем.ТипЗначения.СодержитТип(типЧисло) Тогда
			списокПолей = списокПолей + ", " + Элем.Имя;
		КонецЕсли;
	КонецЦикла;
	Возврат Сред(списокПолей,3);
КонецФункции

Функция ИменаНеЧисловыхКолонокТаблицы(Таблица) Экспорт
	типЧисло = Тип("Число");
	списокПолей = "";
	Для каждого Элем из Таблица.Колонки Цикл
		Если не Элем.ТипЗначения.СодержитТип(типЧисло) Тогда
			списокПолей = списокПолей + ", " + Элем.Имя;
		КонецЕсли;
	КонецЦикла;
	Возврат Сред(списокПолей,3);
КонецФункции

Функция СвернутьТаблицуПоЧисловымПолям(Таблица) Экспорт
	Если Таблица.Количество() > 1 Тогда
		ЧисловыеПоля = ИменаЧисловыхКолонокТаблицы(Таблица);
		Таблица.Свернуть(, ЧисловыеПоля);
	КонецЕсли;
	
	Возврат истина;
КонецФункции

Функция СвернутьТаблицуПоВсемПолям(Таблица) Экспорт
	Если Таблица.Количество() > 1 Тогда
		ЧисловыеПоля = ИменаЧисловыхКолонокТаблицы(Таблица);
		НеЧисловыеПоля = ИменаНеЧисловыхКолонокТаблицы(Таблица);
		Таблица.Свернуть(НеЧисловыеПоля, ЧисловыеПоля);
	КонецЕсли;
	
	Возврат истина;
КонецФункции

Функция УдалитьСтрокиТаблицы(Знач Таблица, СтруктураОтбора) Экспорт
	массивСтрок = Таблица.НайтиСтроки(СтруктураОтбора);
	
	Для каждого Элем из массивСтрок Цикл
		Таблица.Удалить(Элем);
	КонецЦикла;
	
	Возврат истина;
КонецФункции

Функция ВыгрузитьКолонкуВСвернутыйМассив(Знач Таблица, ИмяКолонки, НеИспользоватьНеопределено = ложь) Экспорт
	Таб = Таблица.Скопировать(, ИмяКолонки);
	Таб.Свернуть(ИмяКолонки);
	
	Если НеИспользоватьНеопределено Тогда
		УдалитьСтрокиТаблицы(Таб, новый Структура(ИмяКолонки, Неопределено));
	КонецЕсли;
	
	Возврат Таб.ВыгрузитьКолонку(0);
КонецФункции

Функция ДобавитьКолонкиТаблицыПоОбразцу(ТаблицаПриемник, ТаблицаОбразец) Экспорт
	Для каждого Элем из ТаблицаОбразец.Колонки Цикл
		Если ТаблицаПриемник.Колонки.Найти(Элем.Имя) = Неопределено Тогда
			ТаблицаПриемник.Колонки.Добавить(Элем.Имя, Элем.ТипЗначения);
		КонецЕсли;
	КонецЦикла;
	
	Возврат истина;
КонецФункции

Функция ОбъединитьТаблицы(ТаблицаПриемник, ТаблицаИсточник, ПолноеОбъединение = ложь) Экспорт
	// добавим колонки из источника
	Если ПолноеОбъединение Тогда
		Для каждого Элем из ТаблицаИсточник.Колонки Цикл
			Если ТаблицаПриемник.Колонки.Найти(Элем.Имя) = Неопределено Тогда
				ТаблицаПриемник.Колонки.Добавить(Элем.Имя, Элем.ТипЗначения, Элем.Заголовок, Элем.Ширина);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// добавим данные из источника
	Для каждого строкаИсточника из ТаблицаИсточник Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), строкаИсточника);
	КонецЦикла;
	
	Возврат истина;
КонецФункции

Функция ЗагрузитьТаблицуЗначений(ТаблицаПриемник, ТаблицаИсточник, ОчиститьПередЗагрузкой = ложь) Экспорт
	Если ОчиститьПередЗагрузкой Тогда
		ТаблицаПриемник.Очистить();
	КонецЕсли;
	
	Для каждого Стр из ТаблицаИсточник Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), Стр);
	КонецЦикла;
	
	Возврат истина;
КонецФункции

Функция СреднееЗначениеПоКолонке(Таблица, ИмяКолонки) Экспорт
	ЧислоЗаписей = Таблица.Количество();
	
	Если ЧислоЗаписей = 0 Тогда
		Возврат 0;
	Иначе
		Возврат Таблица.Итог(ИмяКолонки) / ЧислоЗаписей;
	КонецЕсли;
КонецФункции



Функция СформироватьПараметрыЗапускаВнешнейОбработки(пИмя) Экспорт
	пСтрук = Неопределено;
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Вид", Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка);
	Запрос.УстановитьПараметр("ИмяОбъекта", пИмя);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка,
	|	ДополнительныеОтчетыИОбработки.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
	|ГДЕ
	|	ДополнительныеОтчетыИОбработки.Вид = &Вид
	|	И ДополнительныеОтчетыИОбработки.ИмяОбъекта = &ИмяОбъекта";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		пСтрук = новый Структура;
		пСтрук.Вставить("Ссылка", Выборка.Ссылка);
		пСтрук.Вставить("ЭтоОтчет", ложь);
		пСтрук.Вставить("Представление", Выборка.Наименование);
		пСтрук.Вставить("Идентификатор", "ВнешняяОбработка." + пИмя);
	КонецЕсли;
	
	Возврат пСтрук;
КонецФункции


//Галфинд (Гуру/Картэкс) Биматов 2019/05/07 (
//Требование ФТД ОС МСФО
Процедура СкопироватьСвойства_ПолеВвода(НовыйЭлемент, ОпорныйЭлемент) Экспорт
	
	//Не копирую поля - Имя, Родитель, ПутьКДанным, ПутьКДаннымПодвала
	
	ПоляКопирования = 
	//Общие свойства для любого ПоляФормы:
	"АвтоВысотаЯчейки, АктивизироватьПоУмолчанию, ВертикальноеПоложение, Вид, Видимость,ВысотаЗаголовка, ГиперссылкаЯчейки, 
	|ГоризонтальноеПоложение, ГоризонтальноеПоложениеВПодвале, ГоризонтальноеПоложениеВШапке, Доступность, Заголовок,			
	|КартинкаПодвала, КартинкаШапки, ОграничениеТипа, ОтображатьВПодвале, ОтображатьВШапке,
	|ОтображениеПредупрежденияПриРедактировании, Подсказка, ПоложениеЗаголовка, ПредупреждениеПриРедактировании,
	|ПропускатьПриВводе, РежимРедактирования, СочетаниеКлавиш, ТекстПодвала, ТолькоПросмотр, ФиксацияВТаблице,
	|ЦветТекстаЗаголовка, ЦветТекстаПодвала, ЦветФонаЗаголовка, ЦветФонаПодвала, ШрифтЗаголовка, ШрифтПодвала,
	//
	//Свойства расширения ПоляВвода:
	|АвтоВыборНезаполненного, АвтоОтметкаНезаполненного, БыстрыйВыбор, 
	|ВыделятьОтрицательные, Высота, ВысотаСпискаВыбора, 
	|РастягиватьПоВертикали, РастягиватьПоГоризонтали,
	|Формат, ЦветТекста, 
	|ЦветФона, Ширина, Шрифт";
	
	//УБРАЛ поля, они не читались в прошлой задаче, или были не доступными для записи: 
	//(нижеперечисленные поля тоже можно включить в общий список, ведь в итоге вся работа идёт в попытках)
	
	//Маска, ПараметрыВыбора, КнопкаОчистки, КнопкаРегулирования, КнопкаСпискаВыбора, ФормаВыбора, ВыборГруппИЭлементов, РасширенноеРедактирование,  - многие из них не обнаружаются
	//РежимВыбораИзСписка, РежимВыбораНезаполненного, РежимПароля, СвязиПараметровВыбора, СвязьПоТипу, СписокВыбора, ТекстРедактирования, 
	//ШиринаСпискаВыбора, МногострочныйРежим, ОбновлениеТекстаРедактирования, ОтметкаНезаполненного, РазрешитьСоставнойТип, ДоступныеТипы
	//КартинкаКнопкиВыбора, КнопкаВыбора, РедактированиеТекста, ФорматРедактирования, АвтоПереносСтрок, ВыбиратьТип, КнопкаОткрытия
	//ЦветРамки, МинимальноеЗначение, МаксимальноеЗначение, ВыделенныйТекст (оно обычно не читается), КонтекстноеМеню (оно не доступно для записи)
	
	
	СтруктураПолейКопирования = Новый Структура(ПоляКопирования);
	Для каждого эл из СтруктураПолейКопирования Цикл
		Попытка
			НовыйЭлемент[эл.Ключ] = ОпорныйЭлемент[эл.Ключ];
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры //Галфинд (Гуру/Картэкс) Биматов 2019/05/07 )

//Галфинд (Гуру/Картэкс) Биматов 2019/05/07 (
//Требование ФТД ОС МСФО
Функция РазностьМесяцев(ДатаБольшая, ДатаМалая) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РАЗНОСТЬДАТ(&ДатаМалая, &ДатаБольшая, МЕСЯЦ) КАК Разность");
	Запрос.УстановитьПараметр("ДатаБольшая", ДатаБольшая);
	Запрос.УстановитьПараметр("ДатаМалая", ДатаМалая);
	Выб = Запрос.Выполнить().Выбрать();
	Если выб.Следующий() Тогда
		Возврат Выб.Разность;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции //Галфинд (Гуру/Картэкс) Биматов 2019/05/07 )

//Галфинд (Гуру/Картэкс) Биматов 2019/05/07 (
//Требование ФТД ОС МСФО
Процедура СообщитьСервер(Текст) Экспорт
	Со = Новый СообщениеПользователю;
	Со.Текст = Текст;
	Со.Сообщить();
КонецПроцедуры //Галфинд (Гуру/Картэкс) Биматов 2019/05/07 )

Процедура гф_УстановкаПараметровСеанса(ИменаПараметровСеанса) Экспорт
	Если ИменаПараметровСеанса <> Неопределено 
		И ИменаПараметровСеанса.Найти("гф_Организации_ОтдельныйРасчетВыпуска") <> Неопределено Тогда
		МассивОрганизаций = Новый Массив;
		тОрганизация = _омОбщегоНазначения.ПолучитьГлобальноеЗначение("РасчетЗатратНаВыпускОтдельнымДокументом");
		Если ЗначениеЗаполнено(тОрганизация) Тогда
			МассивОрганизаций.Добавить(тОрганизация);
		КонецЕсли;
		тОрганизация_Массив = _омОбщегоНазначения.ПолучитьГлобальноеЗначениеМассив("РасчетЗатратНаВыпускОтдельнымДокументом");
		Для каждого тОрганизация Из тОрганизация_Массив Цикл
			МассивОрганизаций.Добавить(тОрганизация);
		КонецЦикла; 
		
		ПараметрыСеанса.гф_Организации_ОтдельныйРасчетВыпуска = Новый ФиксированныйМассив(МассивОрганизаций);		
	КонецЕсли;
КонецПроцедуры
